export const ERROR_MESSAGE = {
	LOGIN: 'Ошибка! Логин может содержать только латинские буквы, цыфры, пробел и знаки: "-", "_"',
	LOGIN_LONG: 'Ошибка! Логин не должен быть более 20 символов!',
	LOGIN_SHORT: 'Ошибка! Логин не должен быть менее 2-х символов!',
	PASSWORD:
		'Ошибка! Пароль может содержать только латинские буквы, цифры и символы: !@#$%^&*+-',
	PASSWORD_LONG: 'Ошибка! Пароль не должен быть более 30 символов!',
	PASSWORD_SHORT: 'Ошибка! Пароль не должен быть менее 7-ми символов!',
	PASSWORD_REPEAT: 'Ошибка! Пароли не совпадают!',
	REQUIRED: 'Ошибка! Заполните все поля!',
	NO_USERS_FOUND: 'Ни одного клиента не найдено...',
	ACCESS: 'Доступ запрещён!',
	SERVER: 'Сервер не отвечает! Попробуйте перезагрузить страницу. Если ошибка повторится, попробуйте позднее...',
};
